app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]