app/controllers/songs_controller.rb

  def index
    if params[:artist_id] != nil
      @songs = Artist.find_by(id: params[:artist_id]).songs
      redirect_to artist_songs_path
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find_by(id: params[:id])
    if @song && params[:artist_id]
      @song
    else
      flash[:alert] = "Song not found."
      redirect_to artist_songs_path
    end
  end

  1) SongsController GET index redirects when artist not found
     Failure/Error: @songs = Artist.find_by(id: params[:artist_id]).songs
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Isn't She Lovely"], ["created_at", "2020-06-28 18:09:14.848669"], ["updated_at", "2020-06-28 18:09:14.848669"], ["artist_id", 5]]